import fetch from 'node-fetch'
let handler = async (m, { conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems }) => {
try {
let pp = imagen2
let img =  './views/nuevobot.jpg'
let d = new Date(new Date + 3600000)
let locale = 'es'
let week = d.toLocaleDateString(locale, { weekday: 'long' })
let date = d.toLocaleDateString(locale, { day: 'numeric', month: 'long', year: 'numeric' })
let _uptime = process.uptime() * 1000
let uptime = clockString(_uptime)
let user = global.db.data.users[m.sender]
const totalreg = Object.keys(global.db.data.users).length
let rtotalreg = Object.values(global.db.data.users).filter((user) => user.registered == true).length;
let rtotal = Object.entries(global.db.data.users).length || '0'
let more = String.fromCharCode(8206)
let readMore = more.repeat(850)   
let taguser = '@' + m.sender.split("@s.whatsapp.net")[0]
var doc = ['pdf','zip','vnd.openxmlformats-officedocument.presentationml.presentation','vnd.openxmlformats-officedocument.spreadsheetml.sheet','vnd.openxmlformats-officedocument.wordprocessingml.document']
var document = doc[Math.floor(Math.random() * doc.length)]    
let str = `${gt}
乂✰ User:- ${taguser} ღ
乂✰ Owner:- Ofc-Yovani ღ
乂✰ Asset:- ${uptime} ღ
乂✰ Users:- ${rtotal} ღ
乂✰ Registered:- ${rtotalreg} ღ
乂✰ ${(conn.user.jid == global.conn.user.jid ? '' : `This user is a sub bot ღ https://wa.me/${global.conn.user.jid.split`@`[0]}`) || 'This is the main bot ღ'}

〔乂✰📌ɪɴғʙᴏᴛ❓ღ〕
 ├π /ᴍᴇɴᴜ2「ᴀᴜᴅɪᴏ ʟɪsᴛ」
 ├π /ᴀɴɪᴍᴇs「ᴀɴɪᴍᴇ ɪᴍᴀɢᴇs」
 ├π /ɢʀᴜᴘᴏs「ʙᴏᴛ ɢʀᴏᴜᴘ ʟɪsᴛ」
 ├π /ᴏᴡɴᴇʀ「ᴄʀᴇᴀᴛᴏʀ ᴄᴏɴᴛᴀᴄᴛ」
 ├π /ᴇɴᴀʙʟᴇ「ᴄᴏᴍᴍᴀɴᴅ ʟɪsᴛ」
 ├π /ɪɴsᴛᴀʟᴀʀʙᴏᴛ「ᴛʜɪs ɪs ᴛᴏ ɪɴsᴛᴀʟʟ ᴛʜᴇ ʙᴏᴛ」
 ├π /ʟᴏɢᴏs「ᴘᴜᴛ ᴀ ɴᴀᴍᴇ ʏᴏᴜ ᴡᴀɴᴛ ᴀɴᴅ ɪᴛ ʙᴇᴄᴏᴍᴇs」
 ├π /ᴛᴀɢᴀʟʟ「ɪɴᴠᴏᴋᴇs ᴀʟʟ ᴛʜᴇ ɢʀᴏᴜᴘ」
 ├π /sᴄ「ʙᴏᴛ ʀᴇᴘᴏsɪᴛᴏʀʏ」
 ├π /ᴄᴏᴍᴀɴɢʀᴜᴘᴏs「ᴡɪʟʟ ᴇxᴘʟᴀɪɴ ʜᴏᴡ ᴛᴏ ᴀᴄᴛɪᴠᴀᴛᴇ ᴏʀ ᴅᴇᴀᴄᴛɪᴠᴀᴛᴇ ᴄᴏᴍᴍᴀɴᴅs」
 ├π /ɪᴘ「ᴡɪʟʟ ɢɪᴠᴇ ʏᴏᴜ sᴇʀᴠᴇʀ ɪɴғᴏʀᴍᴀᴛɪᴏɴ」
 └─|
  ╭╯
〔乂✰🌟ᴏɴʟʏ ғᴏʀ ᴀᴅᴍɪɴs🌟ღ〕
 ├π /ᴡᴇʟᴄᴏᴍᴇ「ᴛᴀɢ ᴛʜᴇ ᴜsᴇʀ」
 ├π /ʙʏᴇ「ᴛᴀɢ ᴛʜᴇ ᴜsᴇʀ」
 ├π /ᴘʀᴏᴍᴏᴛᴇ「ɢɪᴠᴇ ᴀᴅᴍɪɴɪsᴛʀᴀᴛɪᴏɴ」
 ├π /ᴅᴇᴍᴏᴛᴇ「ʀᴇᴍᴏᴠᴇ ᴀᴅᴍɪɴɪsᴛʀᴀᴛɪᴏɴ」
 ├π /ɪɴғᴏɢʀᴜᴘᴏ「ᴡɪʟʟ ɢɪᴠᴇ ʏᴏᴜ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ᴀʙᴏᴜᴛ ᴛʜᴇ ɢʀᴏᴜᴘ」
 ├π /ʜɪᴅᴇᴛᴀɢ「ɪɴᴠᴏᴋᴇ ᴇᴠᴇʀʏᴏɴᴇ ᴡɪᴛʜ ʏᴏᴜʀ ᴍᴇssᴀɢᴇ」
 ├π /ᴅᴇʟᴇᴛᴇ「ᴡɪʟʟ ᴅᴇʟᴇᴛᴇ ᴍᴇssᴀɢᴇs ғʀᴏᴍ ᴛʜᴇ ʙᴏᴛ」
 ├π /ʟɪɴᴋ「ᴡɪʟʟ ɢɪᴠᴇ ʏᴏᴜ ᴛʜᴇ ɢʀᴏᴜᴘ ʟɪɴᴋ」
 ├π /ᴀᴅᴠᴇʀᴛɪʀ「ɢɪᴠᴇ ᴀ ᴡᴀʀɴɪɴɢ ɪɴ ᴛʜᴇ ɢʀᴏᴜᴘ」
 ├π /ᴜɴᴡᴀʀɴ「ᴛᴀɢ ᴀ ᴘᴇʀsᴏɴ」
 └─|
  ╭╯
〔乂✰🤖ᴊᴀᴅɪʙᴏᴛs🤖ღ〕
 ├π /sᴇʀʙᴏᴛ「ɢɪᴠᴇs ʏᴏᴜ ᴛʜᴇ ǫʀ ᴄᴏᴅᴇ」
 ├π /ᴅᴇʟᴇᴛᴇsᴇʀʙᴏᴛ「ɪᴛ ɪs ᴛᴏ ᴅᴇʟᴇᴛᴇ ʏᴏᴜʀ sᴇssɪᴏɴ」
 ├π /sᴛᴏᴘ「ᴛᴏ ᴛᴇᴍᴘᴏʀᴀʀɪʟʏ ᴅɪsᴀʙʟᴇ ɪᴛ」
 ├π /ᴛᴏᴋᴇɴ「ᴡɪʟʟ sᴇɴᴅ ʏᴏᴜ ᴀ ᴄᴏᴅᴇ ᴛᴏ ᴄᴏɴɴᴇᴄᴛ ᴛᴏ ᴏᴛʜᴇʀ ʙᴏᴛs」
 └─|
  ╭╯
〔乂✰🧿ᴛʀᴀɴsғᴇʀ💎ღ〕
 ├π /ᴛʀᴀɴsғᴇʀ ᴊᴏɪɴᴄᴏᴜɴᴛ「ᴇɴᴛᴇʀ ᴛʜᴇ ᴀᴍᴏᴜɴᴛ ᴏғ ᴅᴏʟʟᴀʀs ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ᴛʀᴀɴsғᴇʀ」
 ├π /ᴛʀᴀɴsғᴇʀ ʟɪᴍɪᴛ「ᴇɴᴛᴇʀ ᴛʜᴇ ᴀᴍᴏᴜɴᴛ ᴏғ ᴅɪᴀᴍᴏɴᴅs ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ᴛʀᴀɴsғᴇʀ」
 ├π /ᴛʀᴀɴsғᴇʀ ᴇxᴘ「ᴇɴᴛᴇʀ ᴛʜᴇ ᴀᴍᴏᴜɴᴛ ᴏғ ᴇxᴘᴇʀɪᴇɴᴄᴇ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ᴛʀᴀɴsғᴇʀ」
 └─|
  ╭╯ 
〔乂✰🎁ʀᴇᴡᴀʀᴅs🎁ღ〕 
 ├π /ᴍɪɴᴀʀ「ɢᴀɪɴ ᴇxᴘᴇʀɪᴇɴᴄᴇ」
 ├π /ᴍɪɴᴀʀ2「ᴡɪɴ ᴅɪᴀᴍᴏɴᴅs」
 ├π /ᴍɪɴᴀʀ3「ᴡɪɴ ʜᴀᴅᴇs-ᴄᴏɪɴs」
 ├π /ᴄʟᴀɪᴍ「ᴛʜɪs ɪs ᴀ ᴅᴀɪʟʏ ᴇxᴘᴇʀɪᴇɴᴄᴇ ʀᴇᴡᴀʀᴅ ᴄʟᴀɪᴍᴇᴅ」
 ├π /ᴄᴏғғᴇʀ「ᴀ ᴅᴀɪʟʏ ʀᴇᴡᴀʀᴅ ᴄʜᴇsᴛ ᴏᴘᴇɴ ɪᴛ ᴛᴏ ʀᴇᴄᴇɪᴠᴇ ʏᴏᴜʀ ʀᴇᴡᴀʀᴅs」
 └─|
  ╭╯
〔乂✰🛒sᴛᴏʀᴇ-sʜᴏᴘ🛒ღ〕 
 ├π /ʙᴜsʏᴀʟʟ「ᴡɪʟʟ ᴄʜᴀʀɢᴇ ʏᴏᴜ ʜᴀᴅᴇs-ᴄᴏɪɴs ᴛᴏ ɢᴇᴛ ᴅɪᴀᴍᴏɴᴅs」
 ├π /ʙᴜʏᴀʟʟ「ɪᴛ ᴡɪʟʟ ᴄʜᴀʀɢᴇ ʏᴏᴜ ғᴏʀ ᴛʜᴇ ᴇxᴘᴇʀɪᴇɴᴄᴇ ʏᴏᴜ ʜᴀᴠᴇ ᴛᴏ ᴏʙᴛᴀɪɴ ᴅɪᴀᴍᴏɴᴅs」
 ├π /ᴅᴏʟᴀʀᴇs「ᴛᴇ ᴄᴏʙʀᴀʀá ᴅɪᴀᴍᴀɴᴛᴇs ᴘᴀʀᴀ ᴏʙᴛᴇɴᴇʀ ᴅóʟᴀʀᴇs」
 ├π /sʜᴏᴘ「ᴡɪʟʟ ᴛᴀᴋᴇ ʏᴏᴜ ᴛᴏ ᴛʜᴇ sᴛᴏʀᴇ」
 ├π /sᴇʟʟ「ᴡɪʟʟ ᴛᴀᴋᴇ ʏᴏᴜ ᴛᴏ ᴛʜᴇ ᴘʀᴇᴍɪᴜᴍ sᴛᴏʀᴇ」
 └─|
  ╭╯ 
〔乂✰✨ᴀᴅᴅ ᴍᴏɴᴇʏ💥ღ〕
 ├π /ᴀñᴀᴅɪʀxᴘ「ʟᴀʙᴇʟ ᴀɴᴅ ᴘᴜᴛ ᴛʜᴇ ᴀᴍᴏᴜɴᴛ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ᴀᴅᴅ」
 ├π /ᴀñᴀᴅɪʀᴅɪᴀᴍᴀɴᴛᴇs「ʟᴀʙᴇʟ ᴀɴᴅ ᴘᴜᴛ ᴛʜᴇ ᴀᴍᴏᴜɴᴛ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ᴀᴅᴅ」
 ├π /ᴀñᴀᴅɪʀᴅᴏʟᴀʀᴇs「ʟᴀʙᴇʟ ᴀɴᴅ ᴘᴜᴛ ᴛʜᴇ ᴀᴍᴏᴜɴᴛ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ᴀᴅᴅ」
 └─|
  ╭╯
〔乂✰👑ᴀᴅᴅ ᴘʀᴇᴍɪᴜᴍ💎ღ〕
 ├π /ᴀᴅᴅᴘʀᴇᴍ1「ᴛᴀɢ ᴀ ᴜsᴇʀ ᴀɴᴅ ᴘᴜᴛ ᴀ ᴘᴇʀᴄᴇɴᴛᴀɢᴇ」
 ├π /ᴀᴅᴅᴘʀᴇᴍ2「ᴛᴀɢ ᴀ ᴜsᴇʀ ᴀɴᴅ ᴘᴜᴛ ᴀ ᴘᴇʀᴄᴇɴᴛᴀɢᴇ」
 ├π /ᴀᴅᴅᴘʀᴇᴍ3「ᴛᴀɢ ᴀ ᴜsᴇʀ ᴀɴᴅ ᴘᴜᴛ ᴀ ᴘᴇʀᴄᴇɴᴛᴀɢᴇ」
 ├π /ᴀᴅᴅᴘʀᴇᴍ4「ᴛᴀɢ ᴀ ᴜsᴇʀ ᴀɴᴅ ᴘᴜᴛ ᴀ ᴘᴇʀᴄᴇɴᴛᴀɢᴇ」
 ├π /ᴀᴅᴅᴘʀᴇᴍ5「ᴛᴀɢ ᴀ ᴜsᴇʀ ᴀɴᴅ ᴘᴜᴛ ᴀ ᴘᴇʀᴄᴇɴᴛᴀɢᴇ」
 ├π /ᴀᴅᴅᴘʀᴇᴍ6「ᴛᴀɢ ᴀ ᴜsᴇʀ ᴀɴᴅ ᴘᴜᴛ ᴀ ᴘᴇʀᴄᴇɴᴛᴀɢᴇ」
 ├π /ᴀᴅᴅᴘʀᴇᴍ7「ᴛᴀɢ ᴀ ᴜsᴇʀ ᴀɴᴅ ᴘᴜᴛ ᴀ ᴘᴇʀᴄᴇɴᴛᴀɢᴇ」
 ├π /ᴀᴅᴅᴘʀᴇᴍ8「ᴛᴀɢ ᴀ ᴜsᴇʀ ᴀɴᴅ ᴘᴜᴛ ᴀ ᴘᴇʀᴄᴇɴᴛᴀɢᴇ」
 └─|
  ╭╯
〔乂✰👾sᴛɪᴋᴇʀs👾ღ〕
 ├π /sᴛɪᴋᴇʀ2「ᴡɪᴛʜ ᴀɴ ɪᴍᴀɢᴇ ᴏʀ ʟɪɴᴋ」
 ├π /sᴛɪᴋᴇʀ「ᴡɪᴛʜ ᴀɴ ɪᴍᴀɢᴇ ᴏʀ ʟɪɴᴋ」
 ├π /ᴡᴍ「 ᴘᴀᴄᴋᴀɢᴇ | ɴᴀᴍᴇ」
 ├π /sᴇʀᴍᴏᴠᴇʀʙɢ 「ɪᴍᴀɢᴇ ᴡɪᴛʜᴏᴜᴛ ʙᴀᴄᴋɢʀᴏᴜɴᴅ」
 ├π /sᴄɪʀᴄʟᴇ「sᴛɪᴄᴋᴇʀ ᴄɪʀᴄᴜʟᴀʀ」
 ├π /ᴘᴀᴛ「ᴡɪʟʟ sᴇɴᴅ ᴀ ᴘᴀᴛ sᴛɪᴄᴋᴇʀ」
 ├π /ᴋɪss「ᴛᴀɢ sᴏᴍᴇᴏɴᴇ ᴛᴏ ɢɪᴠᴇ ᴛʜᴇᴍ ᴀ ᴋɪss」
 ├π /ᴇᴍᴏᴊɪᴍɪx「☺&😈」
 ├π /ᴅᴀᴅᴏs「ᴡɪʟʟ sᴇɴᴅ ᴀ sᴛɪᴄᴋᴇʀ ᴡɪᴛʜ ᴀɴɪᴍᴀᴛɪᴏɴ」
 └─|
  ╭╯
〔乂✰❌ᴄᴏᴍᴍᴀɴᴅ ʀᴇᴘᴏʀᴛ❌ღ〕
 ├π /ʀᴇᴘᴏʀᴛᴇ「ʀᴇᴘᴏʀᴛ ᴛʜᴇ ᴘʀᴏʙʟᴇᴍ ʏᴏᴜ ʜᴀᴠᴇ ᴏʀ ᴛʜᴇ ᴇʀʀᴏʀ ʏᴏᴜ ғᴏᴜɴᴅ ɪɴ ᴛʜᴇ ᴡᴀʀɴɪɴɢ, ᴡᴇ ᴡɪʟʟ ɴᴏᴛ ᴘᴀʏ ᴀᴛᴛᴇɴᴛɪᴏɴ ᴛᴏ ɪᴛ ɪғ ɪᴛ ɪs ᴏɴʟʏ ᴀ ʀᴇᴘᴏʀᴛ ᴛᴏ ᴀɴɴᴏʏ」
 └─|
  ╭╯
〔乂✰🎬ᴅᴏᴡɴʟᴏᴀᴅs🎧ღ〕
 ├π /ᴡɪᴋɪᴘᴇᴅɪᴀ「ᴇɴᴛᴇʀ ᴛʜᴇ ɴᴀᴍᴇ」
 ├π /ᴀɴɪᴍᴇɪɴғᴏ「ᴇɴᴛᴇʀ ᴛʜᴇ ɴᴀᴍᴇ ᴏғ ʏᴏᴜʀ ᴀɴɪᴍᴇ」
 ├π /ᴀᴘᴋ「ᴇɴᴛᴇʀ ʏᴏᴜʀ ᴀᴘᴘ ɴᴀᴍᴇ」
 ├π /ᴘʟᴀʏ「ᴇɴᴛᴇʀ ᴛʜᴇ ɴᴀᴍᴇ ᴏғ ʏᴏᴜʀ sᴏɴɢ ᴏʀ ʟɪɴᴋ」
 ├π /ᴘʟᴀʏ2「ᴇɴᴛᴇʀ ᴛʜᴇ ɴᴀᴍᴇ ᴏғ ʏᴏᴜʀ ᴠɪᴅᴇᴏ ᴏʀ ʟɪɴᴋ」
 ├π /ᴘʟᴀʏ3「ᴇɴᴛᴇʀ ᴛʜᴇ ɴᴀᴍᴇ ᴏʀ ʟɪɴᴋ ᴏғ ʏᴏᴜʀ sᴏɴɢ ɪᴛ ᴡɪʟʟ ʙᴇ ᴅᴏᴡɴʟᴏᴀᴅᴇᴅ ᴀs ᴀ ᴅᴏᴄᴜᴍᴇɴᴛ」
 ├π /ᴘʟᴀʏ4「ᴇɴᴛᴇʀ ᴛʜᴇ ɴᴀᴍᴇ ᴏғ ʏᴏᴜʀ ᴠɪᴅᴇᴏ ᴏʀ ʟɪɴᴋ ɪᴛ ᴡɪʟʟ ʙᴇ ᴅᴏᴡɴʟᴏᴀᴅᴇᴅ ɪɴ ᴅᴏᴄᴜᴍᴇɴᴛ」
 ├π /ᴀᴜᴅɪᴏ「ᴇɴᴛᴇʀ ᴛʜᴇ ɴᴀᴍᴇ ᴏғ ʏᴏᴜʀ sᴏɴɢ」
 ├π /ᴠɪᴅᴇᴏ「ᴇɴᴛᴇʀ ᴛʜᴇ ɴᴀᴍᴇ ᴏғ ʏᴏᴜʀ ᴠɪᴅᴇᴏ」
 ├π /sᴘᴏᴛɪғʏ「ᴇɴᴛᴇʀ ɴᴀᴍᴇ ᴏғ ʏᴏᴜʀ sᴏɴɢ」
 ├π /sᴘᴏᴛɪғʏ2「ᴇɴᴛᴇʀ ᴛʜᴇ ɴᴀᴍᴇ ᴏғ ʏᴏᴜʀ sᴏɴɢ ɪᴛ ᴡɪʟʟ ʙᴇ ᴅᴏᴡɴʟᴏᴀᴅᴇᴅ ɪɴ ᴅᴏᴄᴜᴍᴇɴᴛ」
 ├π /ʏᴛᴍᴘ3「ᴇɴᴛᴇʀ ᴛʜᴇ ʟɪɴᴋ ᴏғ ʏᴏᴜʀ ᴀᴜᴅɪᴏ」
 ├π /ʏᴛᴍᴘ4「ᴇɴᴛᴇʀ ᴛʜᴇ ʟɪɴᴋ ᴏғ ʏᴏᴜʀ ᴠɪᴅᴇᴏ」
 ├π /ʏᴛᴍᴘ3ᴅᴏᴄ「ᴇɴᴛᴇʀ ᴛʜᴇ ʟɪɴᴋ ᴏғ ʏᴏᴜʀ ᴀᴜᴅɪᴏ ᴡɪʟʟ ʙᴇ ᴅᴏᴡɴʟᴏᴀᴅᴇᴅ ɪɴ ᴅᴏᴄᴜᴍᴇɴᴛ」
 ├π /ʏᴛᴍᴘ4ᴅᴏᴄ「ᴇɴᴛᴇʀ ᴛʜᴇ ʟɪɴᴋ ᴏғ ʏᴏᴜʀ ᴠɪᴅᴇᴏ ᴡɪʟʟ ʙᴇ ᴅᴏᴡɴʟᴏᴀᴅᴇᴅ ɪɴ ᴅᴏᴄᴜᴍᴇɴᴛ」
 ├π /ғᴀᴄᴇʙᴏᴏᴋ「ᴇɴᴛᴇʀ ᴛʜᴇ ʟɪɴᴋ ᴏғ ʏᴏᴜʀ ғᴀᴄᴇʙᴏᴏᴋ ᴠɪᴅᴇᴏ」
 ├π /ᴛɪᴋᴛᴏᴋ「ᴇɴᴛᴇʀ ᴛʜᴇ ʟɪɴᴋ ᴏғ ʏᴏᴜʀ ᴛɪᴋ ᴛᴏᴋ ᴠɪᴅᴇᴏ」
 ├π /ᴍᴇᴅɪᴀғɪʀᴇ「ᴇɴᴛᴇʀ ᴛʜᴇ ᴍᴇᴅɪᴀғɪʀᴇ ʟɪɴᴋ」
 ├π /ᴛᴡɪᴛᴛᴇʀ「ᴇɴᴛᴇʀ ᴀ ʟɪɴᴋ ᴛᴏ ᴀ ᴛᴡɪᴛᴛᴇʀ ᴠɪᴅᴇᴏ」
 ├π /ɪɢ「ᴇɴᴛᴇʀ ᴛʜᴇ ɪɴsᴛᴀɢʀᴀᴍ ʟɪɴᴋ」
 ├π /ɢᴏᴏɢʟᴇ「ᴇɴᴛᴇʀ ᴛʜᴇ ɴᴀᴍᴇ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ sᴇᴀʀᴄʜ」
 ├π /ʏᴛʙᴜsᴄᴀʀ「ʏᴏᴜᴛᴜʙᴇ sᴇᴀʀᴄʜ」
 ├π /ɢᴅʀɪᴠᴇ「ᴇɴᴛᴇʀ ᴛʜᴇ ᴅʀɪᴠᴇ ʟɪɴᴋ」
 ├π /ᴡʜᴀᴛᴍᴜsɪᴄ「ʀᴇsᴘᴏɴᴅ ᴛᴏ ᴀᴜᴅɪᴏ ᴏʀ ᴠɪᴅᴇᴏ」
 ├π /ᴄᴀʟᴄᴜʟᴀᴅᴏʀᴀ「ᴇxᴀᴍᴘʟᴇ ᴄᴀʟᴄ 2+2」
 ├π /ssᴡᴇʙ「ʟɪɴᴋ ᴏғ ʏᴏᴜʀ ɪᴍɢ」
 ├π /ᴛᴛs ᴀᴜᴅɪᴏ「ɢᴏᴏɢʟᴇ」
 └─|
  ╭╯
〔乂✰👥ᴄʜᴀᴛɢᴘᴛ👥ღ〕
 ├π /ʜᴀᴅᴇs「ᴀsᴋ」
 ├π /ᴀʟᴇxᴀ「ᴀsᴋ」
 ├π /sɪʀɪ「ᴀsᴋ」
 ├π /ɪᴀ「ᴄʜᴀᴛɢᴘᴛ」
 ├π /ʜᴀᴅᴇsᴠᴏᴢ「ᴀsᴋ」
 ├π /ɪᴀᴠᴏᴢ「ᴀsᴋ」
 ├π /sɪᴍɪ「ᴀsᴋ」
 ├π /ʙᴏᴛ「ᴀsᴋ」
 └─|
  ╭╯
〔乂✰🎮ᴍᴜʟᴛɪɢᴀᴍᴇ🎮ღ〕
 ├π /ʟᴏᴠᴇ「ʟᴏᴠᴇ ᴍᴇᴛᴇʀ」
 ├π /ʟᴇᴠᴇʟᴜᴘ「ʟᴏᴏᴋ ᴀᴛ ʏᴏᴜʀ ʟᴇᴠᴇʟ」
 ├π /ɢᴀʏ2「ᴘᴇʀᴄᴇɴᴛᴀɢᴇ」
 ├π /ᴘᴜᴛᴀ「ᴘᴇʀᴄᴇɴᴛᴀɢᴇ」
 ├π /ᴘᴜᴛᴏ「ᴘᴇʀᴄᴇɴᴛᴀɢᴇ」
 ├π /ᴘᴀᴊᴇʀᴏ「ᴘᴇʀᴄᴇɴᴛᴀɢᴇ」
 ├π /ᴘᴀᴊᴇʀᴀ「ᴘᴇʀᴄᴇɴᴛᴀɢᴇ」
 ├π /ʟᴇsʙɪᴀɴᴀ「ᴘᴇʀᴄᴇɴᴛᴀɢᴇ」
 ├π /ᴘᴠᴘ「ʏᴏᴜ ᴄᴀɴ ᴡɪɴ ᴛʜᴇ ᴘᴠᴘ」
 ├π /sᴏᴘᴀ「ʏᴏᴜ ᴡɪʟʟ ʙᴇ ᴀʙʟᴇ ᴛᴏ ᴄᴏᴍᴘʟᴇᴛᴇ ᴛʜɪs ɢᴀᴍᴇ」
 ├π /ᴘᴘᴛ「ᴘɪᴇᴅʀᴀ/ᴘᴀᴘᴇʟ/ᴛɪᴊᴇʀᴀ」
 ├π /ʀᴇᴛᴏ「ʙᴏᴛ ᴄʜᴀʟʟᴇɴɢᴇ」
 ├π /ᴀᴄᴇʀᴛɪᴊᴏ「ɢᴜᴇssᴇʀ ʏᴏᴜ ᴄᴀɴ ɢᴜᴇss」
 ├π /ᴠᴇʀᴅᴀᴅ「ᴛʀᴜᴛʜ ʙᴏᴛ」
 ├π /ғᴏʀᴍᴀʀᴘᴀʀᴇᴊᴀ「ʀᴀɴᴅᴏᴍ ᴄᴏᴜᴘʟᴇs」
 ├π /sʟᴏᴛ「ʀᴏᴜʟᴇᴛᴛᴇ ʜᴏᴡ ᴍᴜᴄʜ ᴅᴏ ʏᴏᴜ ᴅᴀʀᴇ ᴛᴏ ʙᴇᴛ」
 ├π /ᴘɪʀᴏᴘᴏ「ʙᴏᴛ ᴄᴏᴍᴘʟɪᴍᴇɴᴛ」
 ├π /ᴄᴀsɪɴᴏ「ʙᴇᴛ」
 ├π /ᴍᴇᴍᴇ「ᴍᴇᴍᴇ」
 └─|
︎  ╭╯
〔乂✰👑ᴏᴡɴᴇʀ-ᴄᴏᴍᴍᴀɴᴅs👑ღ〕
 ├π /ʙʟᴏᴄᴋ「ᴛᴀɢ ᴀ ᴜsᴇʀ ᴛᴏ ʙʟᴏᴄᴋ ᴛʜᴇᴍ」
 ├π /ʟɪᴍᴘɪᴀʀʙᴏᴛ「ᴄʟᴇᴀɴs ᴛʜᴇ ʙᴏᴛ」
 ├π /ʙʟᴏᴄᴋʟɪsᴛ「ʙʟᴏᴄᴋᴇᴅ ᴜsᴇʀs」
 ├π /ᴜɴʙʟᴏᴄᴋʟɪsᴛ「ᴛᴀɢ ᴀ ᴜsᴇʀ」
 ├π /ʙᴀɴᴜsᴇʀ「ᴛᴀɢ ᴀ ᴜsᴇʀ ᴛᴏ ʙᴇ ʙᴀɴɴᴇᴅ」
 ├π /sᴇᴛᴘʀᴇғɪx「ʏᴏᴜ ᴄᴀɴ ᴜsᴇ ᴀ ғᴇᴀᴛᴜʀᴇ ᴀs ᴀ ᴘʀᴇғɪx ᴇxᴀᴍᴘʟᴇ / # *」
 ├π /ʀᴇsᴇᴛᴘʀᴇғɪx「ʀᴇsᴇᴛ ᴘʀᴇғɪxᴇs」
 ├π /ᴜɴʙᴀɴᴜsᴇʀ「ᴛᴀɢ ᴀ ᴜsᴇʀ ғᴏʀ ʏᴏᴜʀ ʙʟᴜʀʙ」
 ├π /ᴋɪᴄᴋ「ᴛᴀɢ ᴀ ᴜsᴇʀ ᴛᴏ ʀᴇᴍᴏᴠᴇ ᴛʜᴇᴍ ғʀᴏᴍ ᴛʜᴇ ɢʀᴏᴜᴘ」
 ├π /ғᴀɴᴛᴀsᴍᴀs「ɪᴛ ᴡɪʟʟ ʀᴇᴍᴏᴠᴇ ᴛʜᴇ ᴜsᴇʀs ᴡʜᴏ ᴀʀᴇ ᴅᴇᴀᴄᴛɪᴠᴀᴛᴇᴅ」
 ├π /ᴀɢʀᴇɢᴀʀ「ᴇɴᴛᴇʀ ᴛʜᴇ ɴᴜᴍʙᴇʀ ᴏғ ᴛʜᴇ ᴜsᴇʀ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ᴀᴅᴅ」
 ├π /ʀᴇsᴇᴛʟɪɴᴋ「ᴡɪʟʟ ʀᴇsᴇᴛ ᴛʜᴇ ɢʀᴏᴜᴘ ʟɪɴᴋ」
 ├π /ʙᴀɴᴄʜᴀᴛ「ʙᴀɴ ᴛʜᴇ ᴇɴᴛɪʀᴇ ɢʀᴏᴜᴘ ᴄʜᴀᴛ sᴏ ᴛʜᴀᴛ ɴᴏ ᴏɴᴇ ᴄᴀɴ ᴜsᴇ ɪᴛ」
 ├π /ᴜɴʙᴀɴᴄʜᴀᴛ「ғᴀᴅᴇs ᴛʜᴇ ɢʀᴏᴜᴘ sᴏ ᴜsᴇʀs ᴄᴀɴ ᴜsᴇ ᴛʜᴇ ʙᴏᴛ」
 ├π /ɢʀᴜᴘᴏ「ʏᴏᴜ ᴄᴀɴ ᴄʟᴏsᴇ ɢʀᴏᴜᴘ ᴏʀ ᴏᴘᴇɴ ɢʀᴏᴜᴘ」
 ├π /ᴀᴅᴅᴄᴍᴅ「ʏᴏᴜ ᴄᴀɴ ᴀᴅᴅ ᴄᴏᴍᴍᴀɴᴅs ᴛᴏ ᴀ sᴛɪᴄᴋᴇʀ」
 ├π /ᴅᴇʟᴄᴍᴅ「ʏᴏᴜ ᴄᴀɴ ᴅᴇʟᴇᴛᴇ ᴄᴏᴍᴍᴀɴᴅs ᴛʜᴀᴛ ᴡᴇʀᴇ ᴀᴅᴅᴇᴅ ᴛᴏ sᴛɪᴄᴋᴇʀ」
 ├π /ʟɪsᴛᴄᴍᴅ「ᴛʜᴇ ʟɪsᴛ ᴏғ ᴄᴏᴍᴍᴀɴᴅs ᴛʜᴀᴛ ᴡᴇʀᴇ ᴀᴅᴅᴇᴅ ᴛᴏ sᴛɪᴄᴋᴇʀs」
 ├π /ᴀᴄᴛᴜᴀʟɪᴢᴀʀ「ɪᴛ ɪs ᴛᴏ ᴜᴘᴅᴀᴛᴇ ᴛʜᴇ ʙᴏᴛ ɪғ ᴛʜᴇ ʀᴇᴘᴏsɪᴛᴏʀʏ ʜᴀs ʙᴇᴇɴ ᴜᴘᴅᴀᴛᴇᴅ」
 ├π /ᴅsᴏᴡɴᴇʀ「ɪғ ʏᴏᴜ ɢᴇᴛ ᴀ ᴡᴀɪᴛɪɴɢ ᴍᴇssᴀɢᴇ, ᴜsᴇ ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ」
 ├π /ғɪxᴍsɢᴇsᴘᴇʀᴀ「ɪғ ʏᴏᴜ ɢᴇᴛ ᴀ ᴡᴀɪᴛɪɴɢ ᴍᴇssᴀɢᴇ, ᴜsᴇ ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ」
 └─|
︎  ╭╯
〔乂✰🎙ᴍᴘ3-ᴄᴏɴᴠᴇʀᴛᴇʀ🎙️️ღ〕
 ├π /ᴍᴘ3「ᴛᴀɢ ᴀ ᴠᴏɪᴄᴇ ɴᴏᴛᴇ ᴏʀ ᴠɪᴅᴇᴏ」
 ├π /ᴛᴏɪᴍɢ「ᴛᴀɢ ᴀɴ ɪᴍᴀɢᴇ」
 ├π /ᴛᴏᴀɴɪᴍᴇ「ᴛᴜʀɴ ʏᴏᴜʀ ɪᴍᴀɢᴇ ɪɴᴛᴏ ᴀɴɪᴍᴇ」
 ├π /ᴛᴏɢɪғᴀᴜs「ᴛᴀɢ ᴀ ᴠɪᴅᴇᴏ ᴛᴏ ᴛᴜʀɴ ɪᴛ ɪɴᴛᴏ ᴀ ɢɪғ ᴡɪᴛʜ ᴀᴜᴅɪᴏ」
 ├π /ᴘᴛᴛ「ᴇɴᴛᴇʀ ᴛʜᴇ ᴛᴇxᴛ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ʜᴀᴠᴇ ᴘʟᴀʏᴇᴅ ɪɴ ᴀᴜᴅɪᴏ」
 ├π /ᴛᴏᴍᴘ4「ᴛᴀɢ ᴀ sᴛɪᴄᴋᴇʀ ᴛᴏ ᴛᴜʀɴ ɪᴛ ɪɴᴛᴏ ᴀ ᴠɪᴅᴇᴏ」
 ├π /ᴛᴛs「ᴇɴᴛᴇʀ ᴛʜᴇ ᴛᴇxᴛ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ʜᴀᴠᴇ ᴘʟᴀʏᴇᴅ ɪɴ ᴀᴜᴅɪᴏ」
 ├π /ᴛᴛs2「ᴇɴᴛᴇʀ ᴛʜᴇ ᴛᴇxᴛ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ʜᴀᴠᴇ ᴘʟᴀʏᴇᴅ ɪɴ ᴀᴜᴅɪᴏ」
 ├π /ᴛᴛᴘ3「ᴇɴᴛᴇʀ ᴛʜᴇ ᴛᴇxᴛ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ʜᴀᴠᴇ ᴘʟᴀʏᴇᴅ ɪɴ ᴀᴜᴅɪᴏ」
 ├π /ᴛᴏɢɪғᴀᴜᴅ「ᴛᴀɢ ᴀ ᴠɪᴅᴇᴏ ᴛʜᴀᴛ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ᴛᴜʀɴ ɪɴᴛᴏ ᴀ ɢɪғ ᴡɪᴛʜ ᴀᴜᴅɪᴏ」
 └─|
︎  ╭╯
〔乂✰⚙️ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ ᴜsᴇʀs🔩ღ〕
 ├π /ʜᴅ「sᴇɴᴅ ʏᴏᴜʀ ɪᴍᴀɢᴇ ᴛᴏ ʙᴇ ᴄᴏɴᴠᴇʀᴛᴇᴅ ᴛᴏ ʜᴅ」
 ├π /ᴛᴏᴘᴅғ「ᴛᴀɢ ᴀɴ ɪᴍᴀɢᴇ ᴀɴᴅ ᴘᴜᴛ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅ」
 ├π /ʀᴇᴍᴏᴠᴇʙɢ「ᴛᴀɢ ᴀɴ ɪᴍᴀɢᴇ ᴛᴏ ᴛᴜʀɴ ɪᴛ ɪɴᴛᴏ sᴛɪᴄᴋᴇʀs ᴡɪᴛʜᴏᴜᴛ ᴀ ʙᴀᴄᴋɢʀᴏᴜɴᴅ」
 ├π /sᴛʏʟᴇᴛᴇxᴛ「ʟᴇᴛᴛᴇʀ ᴍᴏᴅɪғɪᴇʀ」
 ├π /ᴀғᴋ「ɢᴇᴛ ᴏɴ ᴀғᴋ」
 ├π /ʟʙ「ᴍᴏɴᴇʏ ʀᴀᴛɪɴɢ」
 ├π /ᴘᴇʀғɪʟ「ʟᴏᴏᴋ ᴀᴛ ʏᴏᴜʀ sᴛᴀᴛᴜs」
 ├π /ᴄʟɪᴍᴀ「ᴇɴᴛᴇʀ ᴛʜᴇ ɴᴀᴍᴇ ᴏғ ʏᴏᴜʀ ᴄᴏᴜɴᴛʀʏ」
 ├π /ᴄᴏᴠɪᴅ「ᴘᴜᴛ ᴛʜᴇ ɴᴀᴍᴇ ᴏғ ʏᴏᴜʀ ᴄᴏᴜɴᴛʀʏ」
 ├π /ʜᴏʀᴀʀɪᴏ「ᴡᴏʀʟᴅ ᴛɪᴍᴇ」
︎ └─|
︎  ╭╯
〔乂✰🎙ᴀᴜᴅɪᴏ-ᴇғғᴇᴄᴛs🎙️️ღ〕
 ├π /ʙᴀss「ᴛᴀɢ ᴀɴ ᴀᴜᴅɪᴏ sᴏ ɪᴛ ᴄᴀɴ ʙᴇ ᴍᴏᴅɪғɪᴇᴅ」
 ├π /ʙʟᴏᴡɴ「ᴛᴀɢ ᴀɴ ᴀᴜᴅɪᴏ sᴏ ɪᴛ ᴄᴀɴ ʙᴇ ᴍᴏᴅɪғɪᴇᴅ」
 ├π /ᴅᴇᴇᴘ「ᴛᴀɢ ᴀɴ ᴀᴜᴅɪᴏ sᴏ ɪᴛ ᴄᴀɴ ʙᴇ ᴍᴏᴅɪғɪᴇᴅ」
 ├π /ᴇᴀʀʀᴀᴘᴇ「ᴛᴀɢ ᴀɴ ᴀᴜᴅɪᴏ sᴏ ɪᴛ ᴄᴀɴ ʙᴇ ᴍᴏᴅɪғɪᴇᴅ」
 ├π /ғᴀsᴛ「ᴛᴀɢ ᴀɴ ᴀᴜᴅɪᴏ sᴏ ɪᴛ ᴄᴀɴ ʙᴇ ᴍᴏᴅɪғɪᴇᴅ」
 ├π /ғᴀᴛ「ᴛᴀɢ ᴀɴ ᴀᴜᴅɪᴏ sᴏ ɪᴛ ᴄᴀɴ ʙᴇ ᴍᴏᴅɪғɪᴇᴅ」
 ├π /ɴɪɢʜᴛᴄᴏʀᴇ「ᴛᴀɢ ᴀɴ ᴀᴜᴅɪᴏ sᴏ ɪᴛ ᴄᴀɴ ʙᴇ ᴍᴏᴅɪғɪᴇᴅ」
 ├π /ʀᴇᴠᴇʀsᴇ「ᴛᴀɢ ᴀɴ ᴀᴜᴅɪᴏ sᴏ ɪᴛ ᴄᴀɴ ʙᴇ ᴍᴏᴅɪғɪᴇᴅ」
 ├π /ʀᴏʙᴏᴛ「ᴛᴀɢ ᴀɴ ᴀᴜᴅɪᴏ sᴏ ɪᴛ ᴄᴀɴ ʙᴇ ᴍᴏᴅɪғɪᴇᴅ」
 ├π /sʟᴏᴡ「ᴛᴀɢ ᴀɴ ᴀᴜᴅɪᴏ sᴏ ɪᴛ ᴄᴀɴ ʙᴇ ᴍᴏᴅɪғɪᴇᴅ」
 ├π /sᴍᴏᴏᴛʜ「ᴛᴀɢ ᴀɴ ᴀᴜᴅɪᴏ sᴏ ɪᴛ ᴄᴀɴ ʙᴇ ᴍᴏᴅɪғɪᴇᴅ」
 ├π /ᴛᴜᴘᴀɪ「ᴛᴀɢ ᴀɴ ᴀᴜᴅɪᴏ sᴏ ɪᴛ ᴄᴀɴ ʙᴇ ᴍᴏᴅɪғɪᴇᴅ」
 └─|
  ╭╯
〔乂✰🧨ᴀᴄʜɪᴇᴠᴇᴍᴇɴᴛs🧧ღ〕
 ├π /ʟᴏɢᴏᴄʜʀɪsᴛᴍᴀs「ᴇɴᴛᴇʀ ᴀ ᴛᴇxᴛ」
 ├π /ʟᴏɢᴏᴄᴏʀᴀᴢᴏɴ「ᴇɴᴛᴇʀ ᴀ ᴛᴇxᴛ」
 ├π /ʏᴛᴄᴏᴍᴍᴇɴᴛ「ᴇɴᴛᴇʀ ᴀ ᴛᴇxᴛ」
 ├π /ʜᴏʀɴʏᴄᴀʀᴅ「ᴛᴀɢ ᴀ ᴜsᴇʀ」
 ├π /sɪᴍᴘᴄᴀʀᴅ「ᴛᴀɢ ᴀ ᴜsᴇʀ」
 ├π /ʟᴏʟɪᴄᴇ「ᴛᴀɢ ᴀ ᴜsᴇʀ」
 ├π /ɪᴛssᴏsᴛᴜᴘɪᴅ「ᴇɴᴛᴇʀ ᴀ ᴛᴇxᴛ」
 ├π /ᴘɪxᴇʟᴀʀ「ᴇɴᴛᴇʀ ᴀ ᴛᴇxᴛ」
 ├π /ʙʟᴜʀ「ᴇɴᴛᴇʀ ᴀ ᴛᴇxᴛ」
 └─|`.trim()
if (m.isGroup) {
//await conn.sendFile(m.chat, vn, 'Darling.mp3', null, m, true, { type: 'audioMessage', ptt: true})
let fkontak2 = { "key": { "participants":"0@s.whatsapp.net", "remoteJid": "status@broadcast", "fromMe": false, "id": "Halo" }, "message": { "contactMessage": { "vcard": `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD` }}, "participant": "0@s.whatsapp.net" }  
conn.sendMessage(m.chat, { image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map(v => v[1] + '@s.whatsapp.net')}, { quoted: fkontak2 })  
} else {    
//await conn.sendFile(m.chat, vn, 'Darling.mp3', null, m, true, { type: 'audioMessage', ptt: true})
let fkontak2 = { "key": { "participants":"0@s.whatsapp.net", "remoteJid": "status@broadcast", "fromMe": false, "id": "Halo" }, "message": { "contactMessage": { "vcard": `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD` }}, "participant": "0@s.whatsapp.net" }  
conn.sendMessage(m.chat, { image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map(v => v[1] + '@s.whatsapp.net')}, { quoted: fkontak2 })}
} catch {
conn.reply(m.chat, '[❗]An error has been detected Therefore the menu will not work', m)
}}
handler.command = /^(menu|menú|memu|memú|help|info|comandos|allmenu|2help|menu1.2|ayuda|commands|commandos|cmd)$/i
handler.exp = 50
handler.register = true
handler.fail = null
export default handler
function clockString(ms) {
let h = isNaN(ms) ? '--' : Math.floor(ms / 3600000)
let m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60
let s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60
return [h, m, s].map(v => v.toString().padStart(2, 0)).join(':')}